{
	"Agile" :[
		{
			"Title" :"Desenvolvimento ágil de software",
			"Resume":"Método ágil é um conjunto de metodologias de desenvolvimento de software. O desenvolvimento ágil, tal como qualquer metodologia de software, providencia uma estrutura conceitual para reger projetos de engenharia de software."  	
		},
		{
			"Title" :"Valores",
			"Resume":"Indivíduos e interações mais que processos e ferramentas; Software funcional mais que documentação abrangente; Colaboração do cliente mais que negociação de contratos; Responder a mudanças mais que seguir um plano"	
		},
		{
			"Title" :"Agregar valor",
			"Resume":"Nossa maior prioridade é satisfazer o cliente através da entrega contínua e adiantada de software com valor agregado."	
		},
		{
			"Title" :"Requisitos Mudam",
			"Resume":"Mudanças nos requisitos são bem-vindas, mesmo tardiamente no desenvolvimento. Processos ágeis tiram vantagem das mudanças visando vantagem competitiva para o cliente."	
		},
		{
			"Title" :"Entregas Constantes",
			"Resume":"Entregar frequentemente software funcionando, de poucas semanas a poucos meses, com preferência à menor escala de tempo."	
		},
		{
			"Title" :"Clientes fazem parte da equipes.",
			"Resume":"Pessoas de negócio e desenvolvedores devem trabalhar diariamente em conjunto por todo o projeto."	
		},
		{
			"Title" :"Ambiente Motivado",
			"Resume":"Construa projetos em torno de indivíduos motivados. Dê a eles o ambiente e o suporte necessário e confie neles para fazer o trabalho."	
		},
		{
			"Title" :"Comunicação direta",
			"Resume":"O método mais eficiente e eficaz de transmitir informações para e entre uma equipe de desenvolvimento é através de conversa face a face."	
		},
		{
			"Title" :"Funcionalidade mede progresso",
			"Resume":"Software funcionando é a medida primária de progresso."	
		},
		{
			"Title" :"Ritmo constante",
			"Resume":"Os processos ágeis promovem desenvolvimento sustentável. Os patrocinadores, desenvolvedores e usuários devem ser capazes de manter um ritmo constante indefinidamente."	
		},
		{
			"Title" :"Qualidade",
			"Resume":"Contínua atenção à excelência técnica e bom design aumenta a agilidade."	
		},
		{
			"Title" :"Faça apenas o necessário",
			"Resume":"Simplicidade a arte de maximizar a quantidade de trabalho não realizado é essencial."	
		},
		{
			"Title" :"Times auto-organizáveis",
			"Resume":"As melhores arquiteturas, requisitos e designs emergem de equipes auto-organizáveis."	
		},
		{
			"Title" :"Melhoria constante",
			"Resume":"Em intervalos regulares, a equipe reflete sobre como se tornar mais eficaz e então refina e ajusta seu comportamento de acordo."	
		}
	],
	"Scrum":[
		{
			"Title" :"Scrum",
			"Resume":"Scrum é uma metodologia ágil para gestão e planejamento de projetos de software. No Scrum, os projetos são divididos em ciclos (tipicamente mensais) chamados de Sprints. O Sprint representa um Time Box dentro do qual um conjunto de atividades deve ser executado."	
		},
		{
			"Title" :"Transparência",
			"Resume":"Aspectos significativos do processo devem estar visíveis aos responsáveis pelos resultados. Esta transparência requer aspectos definidos por um padrão comum para que os observadores compartilharem um mesmo entendimento do que está sendo visto."	
		},
		{
			"Title" :"Inspeção",
			"Resume":"Os usuários Scrum devem, frequentemente, inspecionar os artefatos Scrum e o progresso em direção a detectar variações. Esta inspeção não deve, no entanto, ser tão frequente que atrapalhe a própria execução das tarefas. As inspeções são mais benéficas quando realizadas de forma diligente por inspetores especializados no trabalho a se verificar. "	
		},
		{
			"Title" :"Adaptação",
			"Resume":"Se um inspetor determina que um ou mais aspectos de um processo desviou para fora dos limites aceitáveis, e que o produto resultado será inaceitável, o processo ou o material sendo produzido deve ser ajustado. O ajuste deve ser realizado o mais breve possível para minimizar mais desvios."	
		},
		{
			"Title" :"Sprint",
			"Resume":"Uma sprint é a unidade básica de desenvolvimento em Scrum. Sprints tendem a durar entre uma semana e um mês, e são um esforço dentro de uma faixa de tempo (ou seja, restrito a uma duração específica) de comprimento constante."	
		},
		{
			"Title" :"Sprint",
			"Resume":"Cada sprint é precedido por uma reunião de planejamento (Sprint Planning), onde as tarefas para a sprint são identificadas e um compromisso estimado para o objetivo da sprint é definido e seguido por uma reunião de revisão ou de retrospectiva, onde o progresso é revisto e lições para os próximos sprints são identificadas."
		},
		{
			"Title" :"Sprint",
			"Resume":"Durante cada sprint, a equipe cria um incremento de produto potencialmente entregável (por exemplo, software funcional e testado). O conjunto de funcionalidades que entram em um sprint vêm do Product Backlog, que é um conjunto de prioridades de requisitos de alto nível definidos pelo Product Owner."	
		},
		{
			"Title" :"Product Owner (dono do produto)",
			"Resume":"O Product Owner representa a voz do cliente e é responsável por garantir que a equipe agregue valor ao negócio. O Product Owner escreve centrado nos itens do cliente (histórias tipicamente do usuário), os prioriza e os adiciona para o product backlog. Recomenda-se que este papel não seja combinado com o de ScrumMaster."	
		},
		{
			"Title" :"Equipe de Desenvolvimento (Development Team)",
			"Resume":"A equipe de desenvolvimento é responsável pela entrega do produto. A equipe é tipicamente composta de 5-9 pessoas com habilidades multifuncionais que fazem o trabalho real (analisar, projetar, desenvolver, testar técnicas de comunicação, documentos, etc.) Recomenda-se que a equipe seja auto-organizada e auto-conduzida, mas que muitas vezes trabalhem com alguma forma de projeto ou gestão de equipe."	
		},
		{
			"Title" :"Scrum Master",
			"Resume":"Scrum é facilitado por um Scrum Master, que é responsável pela remoção de impedimentos à capacidade da equipe para entregar o objetivo da sprint / entregas. O Scrum Master não é o líder da equipe, mas age como um tampão entre a equipe e qualquer influência ou distração. O Scrum Master garante que o processo Scrum seja usado como pretendido. "	
		},
		{
			"Title" :"Backlog",
			"Resume":"Um backlog é uma lista de itens priorizados a serem desenvolvidos para um software. Este artefato é a principal fonte de informação para o Planejamento de sprint (Sprint Planning). No decorrer da sprint, o Product Owner, o Scrum Master e a Equipe decidem no que a equipe irá trabalhar."	
		},
		{
			"Title" :"Product Backlog",
			"Resume":"O Product Backlog é mantido pelo Product Owner e é uma lista de requisitos que tipicamente vêm do cliente. O Product Backlog pode ser alterado a qualquer momento pelo Product Owner ou por decisão deste."	
		},
		{
			"Title" :"Sprint Backlog",
			"Resume":"O Sprint Backlog é uma lista de itens selecionados do Product backlog e contém tarefas concretas que serão realizadas durante a próxima sprint para implementar tais itens selecionados. O Sprint Backlog é uma representação em tempo real do trabalho que o Development Team planeja concluir na sprint corrente, e ele pertence unicamente ao Development Team."	
		},
		{
			"Title" :"Daily Scrum Meeting",
			"Resume":"Cada dia durante a sprint, uma reunião de status do projeto ocorre. Isso é chamado de 'scrum diário', ou 'de pé o dia'. Esta reunião tem diretrizes específicas"	
		},
		{
			"Title" :"Daily Scrum Meeting",
			"Resume":"A reunião começa precisamente no horário marcado; Todos são bem-vindos, mas apenas 'poucos' podem falar; O encontro tem duração determinada (Time-Box) e dura no máximo 15 minutos; A reunião deve acontecer no mesmo local e mesma hora todos os dias."	
		},
		{
			"Title" :"Reunião de Planejamento da Sprint (Sprint Planning Meeting)",
			"Resume":"No início do ciclo de sprint (a cada 7-30 dias), um Sprint Planning Meeting é realizado."	
		},
		{
			"Title" :"Reunião de Planejamento da Sprint (Sprint Planning Meeting)",
			"Resume":"Selecione o trabalho que está a ser feito; Prepare o Sprint Backlog que detalha o tempo que levará para fazer esse trabalho, com toda a equipe; Identificar e comunicar o quanto o trabalho é susceptível de ser feito durante a sprint atual"	
		},
		{
			"Title" :"Reunião de Planejamento da Sprint (Sprint Planning Meeting)",
			"Resume":"Dividida em duas partes: Parte 1 (Primeiras quatro horas): Team Product Owner: diálogo para priorizar o Product Backlog; Parte 2 (Próximas quatro horas): Team apenas: hash de um plano para a Sprint, resultando na Sprint Backlog."	
		},
		{
			"Title" :"Reunião de Revisão da Sprint (Sprint Review)",
			"Resume":"Rever o trabalho que foi concluído e não concluído. Apresentar o trabalho realizado para os stakeholders (ou 'a demo'). Um trabalho incompleto não pode ser demonstrado."	
		},
		{
			"Title" :"Retrospectiva da Sprint (Sprint Retrospective)",
			"Resume":"Todos os membros da equipe refletem sobre a sprint passada. Faça melhorias contínuas de processos. Duas questões principais são feitas na retrospectiva da sprint: O que correu bem durante a corrida? O que poderia ser melhorado na próxima sprint?"	
		}
	],
	"XP":[
	],
	"Lean":[
	]
}
